<?xml version="1.0" ?>
<net batch="1" name="pytorch" version="4">
	<layers>
		<layer id="0" name="data" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="ConvNdBackward2" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="9,9" output="32" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="15552"/>
				<biases offset="15552" size="64"/>
			</blobs>
		</layer>
		<layer id="2" name="BatchNormBackward3_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15616" size="64"/>
				<biases offset="15680" size="64"/>
			</blobs>
		</layer>
		<layer id="5" name="ConvNdBackward5" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15744" size="36864"/>
				<biases offset="52608" size="128"/>
			</blobs>
		</layer>
		<layer id="6" name="BatchNormBackward6_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="52736" size="128"/>
				<biases offset="52864" size="128"/>
			</blobs>
		</layer>
		<layer id="9" name="ConvNdBackward8" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="52992" size="147456"/>
				<biases offset="200448" size="256"/>
			</blobs>
		</layer>
		<layer id="10" name="BatchNormBackward9_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="200704" size="256"/>
				<biases offset="200960" size="256"/>
			</blobs>
		</layer>
		<layer id="13" name="ConvNdBackward11" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="201216" size="294912"/>
				<biases offset="496128" size="256"/>
			</blobs>
		</layer>
		<layer id="14" name="BatchNormBackward12_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="496384" size="256"/>
				<biases offset="496640" size="256"/>
			</blobs>
		</layer>
		<layer id="17" name="ConvNdBackward14" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="496896" size="294912"/>
				<biases offset="791808" size="256"/>
			</blobs>
		</layer>
		<layer id="18" name="BatchNormBackward15_bn" precision="FP16" type="MVN_Scale">
			<data use_relu="0" across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="792064" size="256"/>
				<biases offset="792320" size="256"/>
			</blobs>
		</layer>
		<layer id="20" name="AddBackward17" precision="FP16" type="Eltwise">
			<data coeff="" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ConvNdBackward18" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="792576" size="294912"/>
				<biases offset="1087488" size="256"/>
			</blobs>
		</layer>
		<layer id="22" name="BatchNormBackward19_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1087744" size="256"/>
				<biases offset="1088000" size="256"/>
			</blobs>
		</layer>
		<layer id="25" name="ConvNdBackward21" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1088256" size="294912"/>
				<biases offset="1383168" size="256"/>
			</blobs>
		</layer>
		<layer id="26" name="BatchNormBackward22_bn" precision="FP16" type="MVN_Scale">
			<data use_relu="0" across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1383424" size="256"/>
				<biases offset="1383680" size="256"/>
			</blobs>
		</layer>
		<layer id="28" name="AddBackward24" precision="FP16" type="Eltwise">
			<data coeff="" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ConvNdBackward25" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1383936" size="294912"/>
				<biases offset="1678848" size="256"/>
			</blobs>
		</layer>
		<layer id="30" name="BatchNormBackward26_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1679104" size="256"/>
				<biases offset="1679360" size="256"/>
			</blobs>
		</layer>
		<layer id="33" name="ConvNdBackward28" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1679616" size="294912"/>
				<biases offset="1974528" size="256"/>
			</blobs>
		</layer>
		<layer id="34" name="BatchNormBackward29_bn" precision="FP16" type="MVN_Scale">
			<data use_relu="0" across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1974784" size="256"/>
				<biases offset="1975040" size="256"/>
			</blobs>
		</layer>
		<layer id="36" name="AddBackward31" precision="FP16" type="Eltwise">
			<data coeff="" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="ConvNdBackward32" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1975296" size="294912"/>
				<biases offset="2270208" size="256"/>
			</blobs>
		</layer>
		<layer id="38" name="BatchNormBackward33_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2270464" size="256"/>
				<biases offset="2270720" size="256"/>
			</blobs>
		</layer>
		<layer id="41" name="ConvNdBackward35" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2270976" size="294912"/>
				<biases offset="2565888" size="256"/>
			</blobs>
		</layer>
		<layer id="42" name="BatchNormBackward36_bn" precision="FP16" type="MVN_Scale">
			<data use_relu="0" across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2566144" size="256"/>
				<biases offset="2566400" size="256"/>
			</blobs>
		</layer>
		<layer id="44" name="AddBackward38" precision="FP16" type="Eltwise">
			<data coeff="" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="ConvNdBackward39" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2566656" size="294912"/>
				<biases offset="2861568" size="256"/>
			</blobs>
		</layer>
		<layer id="46" name="BatchNormBackward40_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2861824" size="256"/>
				<biases offset="2862080" size="256"/>
			</blobs>
		</layer>
		<layer id="49" name="ConvNdBackward42" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2862336" size="294912"/>
				<biases offset="3157248" size="256"/>
			</blobs>
		</layer>
		<layer id="50" name="BatchNormBackward43_bn" precision="FP16" type="MVN_Scale">
			<data use_relu="0" across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3157504" size="256"/>
				<biases offset="3157760" size="256"/>
			</blobs>
		</layer>
		<layer id="52" name="AddBackward45" precision="FP16" type="Eltwise">
			<data coeff="" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="UpsamplingNearest2d46" precision="FP16" type="Upsampling">
			<!--data dilations="1,1" group="128" kernel="2,2" output="128" pads_begin="0,0" pads_end="0,0" strides="2,2"/-->
			<data scale="2" num_filter="1" sample_type="nearest"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3158016" size="1024"/>
			</blobs>
		</layer>
		<layer id="54" name="ConvNdBackward47" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3159040" size="147456"/>
				<biases offset="3306496" size="128"/>
			</blobs>
		</layer>
		<layer id="55" name="BatchNormBackward48_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3306624" size="128"/>
				<biases offset="3306752" size="128"/>
			</blobs>
		</layer>
		<layer id="58" name="UpsamplingNearest2d50" precision="FP16" type="Upsampling">
			<!--data dilations="1,1" group="64" kernel="2,2" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/-->
			<data scale="2" num_filter="1" sample_type="nearest"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3306880" size="512"/>
			</blobs>
		</layer>
		<layer id="59" name="ConvNdBackward51" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3307392" size="36864"/>
				<biases offset="3344256" size="64"/>
			</blobs>
		</layer>
		<layer id="60" name="BatchNormBackward52_bn" precision="FP16" type="MVN_Scale">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3344320" size="64"/>
				<biases offset="3344384" size="64"/>
			</blobs>
		</layer>
		<layer id="63" name="ConvNdBackward54" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="9,9" output="3" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3344448" size="15552"/>
				<biases offset="3360000" size="6"/>
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="3" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="20" from-port="2" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="3" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="3" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="28" from-port="2" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="37" from-port="3" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="3" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="44" to-port="0"/>
		<edge from-layer="36" from-port="2" to-layer="44" to-port="1"/>
		<edge from-layer="44" from-port="2" to-layer="45" to-port="0"/>
		<edge from-layer="45" from-port="3" to-layer="46" to-port="0"/>
		<edge from-layer="46" from-port="1" to-layer="49" to-port="0"/>
		<edge from-layer="49" from-port="3" to-layer="50" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="52" to-port="0"/>
		<edge from-layer="44" from-port="2" to-layer="52" to-port="1"/>
		<edge from-layer="52" from-port="2" to-layer="53" to-port="0"/>
		<edge from-layer="53" from-port="2" to-layer="54" to-port="0"/>
		<edge from-layer="54" from-port="3" to-layer="55" to-port="0"/>
		<edge from-layer="55" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="58" from-port="2" to-layer="59" to-port="0"/>
		<edge from-layer="59" from-port="3" to-layer="60" to-port="0"/>
		<edge from-layer="60" from-port="1" to-layer="63" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="1.5.12.49d067a0"/>
		<cli_parameters>
			<batch value="1"/>
			<data_type value="half"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<extensions value="DIR"/>
			<framework value="caffe"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR/weeping_woman.caffemodel"/>
			<input_proto value="DIR/model.prototxt"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<log_level value="ERROR"/>
			<mean_values value="()"/>
			<model_name value="model-16"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="finegrain_fusing, freeze_placeholder_with_value, input, input_shape, mean_file, mean_file_offsets, output, scale"/>
		</cli_parameters>
	</meta_data>
</net>
